# Используем официальный образ Golang в качестве базового
FROM golang:1.16 AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go модули и код приложения
COPY go.mod go.sum ./
RUN go mod download
COPY . .

# Компилируем приложение внутри контейнера
RUN CGO_ENABLED=0 GOOS=linux go build -o app

# Второй этап: создаем минимальный образ для запуска приложения
FROM alpine:latest

# Устанавливаем пакеты, необходимые для работы Redis и прочие утилиты
RUN apk --no-cache add ca-certificates redis

# Копируем скомпилированное приложение из первого этапа
COPY --from=builder /app/app /app/app

# Копируем файл .env
COPY .env /app/.env

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Открываем порт, на котором будет работать сервер, дефолтное значение = 8200
EXPOSE 8200

# Запускаем приложение при старте контейнера
CMD ["./app"]
